pub mod data;
mod map;
mod model;

pub fn print_banner() {
    let version = env!("CARGO_PKG_VERSION");
    let banner = format!(
        r#"
    ██████╗ ██╗███╗   ██╗███████╗██╗     ███████╗██████╗
    ██╔══██╗██║████╗  ██║╚══███╔╝██║     ██╔════╝██╔══██╗
    ██████╔╝██║██╔██╗ ██║  ███╔╝ ██║     █████╗  ██████╔╝
    ██╔══██╗██║██║╚██╗██║ ███╔╝  ██║     ██╔══╝  ██╔══██╗
    ██║  ██║██║██║ ╚████║███████╗███████╗███████╗██║  ██║
    ╚═╝  ╚═╝╚═╝╚═╝  ╚═══╝╚══════╝╚══════╝╚══════╝╚═╝  ╚═╝

        ✨ A somewhat intelligent Web API scanner ✨
              💕  with love from akses  💕
                   v{}

        Use --help or -h for usage information
    "#,
        version
    );

    println!("{}", banner);
}
